УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Forms/CRM_ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Смарт: Белоусова 618 30.08.2021
	
	
	НовыйЭлемент = Элементы.Добавить("смартРабочаяПочта", Тип("ПолеФормы"),элементы.КонтактнаяИнформация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартРабочаяПочта";
	НовыйЭлемент.Заголовок = "Рабочая почта";
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартРабочаяПочта");
	
	
	НовыйЭлемент = Элементы.Добавить("смартРабочийТелефон", Тип("ПолеФормы"),элементы.КонтактнаяИнформация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартРабочийТелефон";
	НовыйЭлемент.Заголовок = "Рабочий телефон";
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартРабочийТелефон");
	
	//-- Смарт: Белоусова 618 30.08.2021

	//++#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)  
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартНомерТелефонаПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("смартВнутреннийНомерВАТС", Тип("ПолеФормы"),элементы.КонтактнаяИнформация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартВнутреннийНомерВАТС";
	НовыйЭлемент.Заголовок = "Внутренний номер ВАТС";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартНомерТелефонаПриИзменении");
	//--#1352 смарт: Лопато 04.05.2023 
	
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	НовыйЭлемент = Элементы.Добавить("смартВнутреннийНомерВАТСДополнительный", Тип("ПолеФормы"),элементы.КонтактнаяИнформация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартВнутреннийНомерВАТСДополнительный";
	НовыйЭлемент.Заголовок = "Внутренний номер ВАТС дополнительный";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартНомерТелефонаПриИзменении");
	
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 14.09.2021 19:20:23
	НовыйЭлемент = Элементы.Добавить("смартМенеджерСайта", Тип("ПолеФормы"),элементы.КонтактнаяИнформация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартМенеджерСайта";
	НовыйЭлемент.Заголовок = "Менеджер сайта Битрикс";
	//Смарт }Подкин Алексей Иванович 14.09.2021 19:20:23
	
	//++#1012 смарт: Холопов 04.05.2022 // Добавление подсказок для телефонов в КИ 
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);	 
	//--#1012 смарт: Холопов 04.05.2022  
	
	//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами.
	НоваяСтраница = Элементы.Вставить("смартСтраницаОповещениеОБИнтересах", Тип("ГруппаФормы"), Элементы.Страницы);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	//++ #Б-6630 смарт: Фролов 27.04.2026 //Сделать механизм оповещений о новых Инцидентах.
	//НоваяСтраница.Заголовок = "Оповещение об интересах (смарт)";
	НоваяСтраница.Заголовок = "Оповещение об интересах и инцидентах (Смарт)";
	//-- #Б-6630 смарт: Фролов 27.04.2026
	НоваяСтраница.Видимость = Истина;
	
	ПолесмартОповещениеОбИнтересах = Элементы.Добавить("смартОповещениеОбИнтересах", Тип("ТаблицаФормы"),
		Элементы.смартСтраницаОповещениеОБИнтересах);
	ПолесмартОповещениеОбИнтересах.ПутьКДанным = "Объект.смартОповещениеОбИнтересах";
	ПолесмартОповещениеОбИнтересах.Отображение = ОтображениеТаблицы.Список;
	ПолесмартОповещениеОбИнтересах.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
	НоваяКолонка = Элементы.Добавить("смартПодразделение", Тип("ПолеФормы"), Элементы.смартОповещениеОбИнтересах);
	НоваяКолонка.Заголовок = "Подразделение";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Подразделение";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	//++ #Б-6630 смарт: Фролов 28.04.2026 //Сделать механизм оповещений о новых Инцидентах.
	НоваяКолонка = Элементы.Вставить("смартОбъектОповещения", Тип("ПолеФормы"), Элементы.смартОповещениеОбИнтересах
		, Элементы.смартПодразделение);
	НоваяКолонка.Заголовок = "Объект оповещения";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.ОбъектОповещения";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.РежимВыбораИзСписка = Истина;
	НоваяКолонка.СписокВыбора.Добавить("Инциденты");
	НоваяКолонка.СписокВыбора.Добавить("Интересы");
	
	Элементы.смартПодразделение.РежимВыбораИзСписка = Истина;
	ЗапросПодразделения = Новый Запрос(
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	НЕ СтруктураПредприятия.ПометкаУдаления
	|	И СтруктураПредприятия.смартОрганизацияВладелец = &смартОрганизацияВладелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктураПредприятия.Наименование");
	ЗапросПодразделения.УстановитьПараметр("смартОрганизацияВладелец", Справочники.смартПредопределенныеЗначения.ОрганизацияБитрикс.Значение);
	
	Элементы.смартПодразделение.СписокВыбора.ЗагрузитьЗначения(ЗапросПодразделения.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Элементы.смартПодразделение.СписокВыбора.Вставить(0, "Все подразделения");
	//-- #Б-6630 смарт: Фролов 29.04.2026
	
	НоваяКолонка = Элементы.Добавить("смартНовые", Тип("ПолеФормы"), Элементы.смартОповещениеОбИнтересах);
	НоваяКолонка.Заголовок = "Новые";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Новые";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
		
	НоваяКолонка = Элементы.Добавить("смартЗавершенные", Тип("ПолеФормы"), Элементы.смартОповещениеОбИнтересах);
	НоваяКолонка.Заголовок = "Завершенные";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Завершенные";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	//-- #Б-3560 смарт: Фролов 01.07.2025
	
	//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.
	НоваяКолонка = Элементы.Вставить("смартКвалификация", Тип("ПолеФормы"), Элементы.смартОповещениеОбИнтересах, Элементы.смартЗавершенные);
	НоваяКолонка.Заголовок = "Квалификация";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Квалификация";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	
	НовыйЭлементГруппа = Элементы.Вставить("смартГруппаТипПродукта", Тип("ГруппаФормы"), Элементы.смартОповещениеОбИнтересах); 
	
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
	НовыйЭлементГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
	НовыйЭлементГруппа.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента .Центр;
	НовыйЭлементГруппа.ОтображатьВШапке = Истина;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Истина;
	НовыйЭлементГруппа.Заголовок = "Тип продукта";
	
	НоваяКолонка = Элементы.Добавить("смартОборудование", Тип("ПолеФормы"), Элементы.смартГруппаТипПродукта);
	НоваяКолонка.Заголовок = "Оборудование";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Оборудование";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	
	НоваяКолонка = Элементы.Добавить("смартЗапчасти", Тип("ПолеФормы"), Элементы.смартГруппаТипПродукта);
	НоваяКолонка.Заголовок = "Запчасти";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Запчасти";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;

	НоваяКолонка = Элементы.Добавить("смартРасходныеМатериалы", Тип("ПолеФормы"), Элементы.смартГруппаТипПродукта);
	НоваяКолонка.Заголовок = "Расходные материалы";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.РасходныеМатериалы";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	
	НоваяКолонка = Элементы.Добавить("смартПрочее", Тип("ПолеФормы"), Элементы.смартГруппаТипПродукта);
	НоваяКолонка.Заголовок = "Прочее";
	НоваяКолонка.ПутьКДанным = "Объект.смартОповещениеОбИнтересах.Прочее";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	//-- #Б-3858 смарт: Фролов 18.07.2025
	
	//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.
	ПолесмартКонтролируемыеМенеджеры = Элементы.Добавить("смартКонтролируемыеМенеджеры", Тип("ТаблицаФормы"),
		Элементы.смартСтраницаОповещениеОБИнтересах);
	ПолесмартКонтролируемыеМенеджеры.ПутьКДанным = "Объект.смартКонтролируемыеМенеджеры";
	ПолесмартКонтролируемыеМенеджеры.Отображение = ОтображениеТаблицы.Список;
	ПолесмартКонтролируемыеМенеджеры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ПолесмартКонтролируемыеМенеджеры.Заголовок = "Контролируемые менеджеры";
	ПолесмартКонтролируемыеМенеджеры.ЦветТекстаЗаголовка = Новый Цвет(0, 150, 70);
	ПолесмартКонтролируемыеМенеджеры.ШрифтЗаголовка = Новый Шрифт(ПолесмартКонтролируемыеМенеджеры.ШрифтЗаголовка, "Arial", 11, Истина);
	
	НоваяКолонка = Элементы.Добавить("смартПользователь", Тип("ПолеФормы"), Элементы.смартКонтролируемыеМенеджеры);
	НоваяКолонка.Заголовок = "Пользователь";
	НоваяКолонка.ПутьКДанным = "Объект.смартКонтролируемыеМенеджеры.Пользователь";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	//-- #Б-7838 смарт: Фролов 12.08.2026

КонецПроцедуры

&НаКлиенте
Процедура смарт_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	//++#1352 смарт: Лопато 10.05.2023 //Звонки из 1С (через городской стационарный телефон)  
	смартПроверитьДублиНомеров(Отказ);
	//--#1352 смарт: Лопато 10.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_НедействителенПриИзмененииПосле(Элемент)

	//++#1352 смарт: Лопато 10.05.2023 //Звонки из 1С (через городской стационарный телефон)  
	Если НЕ Параметры.Ключ.Пустая() И НЕ Объект.Недействителен И смартПроверитьПользовательБылНедействителен() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Очищены внутренние номера телефонов: Внутр.: " + СокрЛП(Объект.смартРабочийТелефон) 
												+ ", ВАТС: " + СокрЛП(Объект.смартВнутреннийНомерВАТС),
												//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
												+ ", ВАТС дополнительный: " + СокрЛП(Объект.смартВнутреннийНомерВАТСДополнительный),
												//-- #Б-6744 смарт: Фролов 28.05.2026
			Объект.Ссылка,
			"Объект.смартРабочийТелефон");

		Объект.смартРабочийТелефон 	 	= Неопределено;
		Объект.смартВнутреннийНомерВАТС = Неопределено;
		//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
		Объект.смартВнутреннийНомерВАТСДополнительный = Неопределено;
		//-- #Б-6744 смарт: Фролов 28.05.2026
	КонецЕсли;	
	//--#1352 смарт: Лопато 10.05.2023

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1352 смарт: Лопато 10.05.2023 //Звонки из 1С (через городской стационарный телефон)  
&НаСервере
Функция смартПроверитьПользовательБылНедействителен()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ТекущийПользовательСсылка
		|	И Пользователи.Недействителен";
	
	Запрос.УстановитьПараметр("ТекущийПользовательСсылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции //--#1352 смарт: Лопато 10.05.2023

//++#1352 смарт: Лопато 10.05.2023 //Звонки из 1С (через городской стационарный телефон)  
&НаСервере
Процедура смартПроверитьДублиНомеров(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.смартРабочийТелефон,
		//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
		|	Пользователи.смартВнутреннийНомерВАТСДополнительный,
		//-- #Б-6744 смарт: Фролов 28.05.2026
		|	Пользователи.смартВнутреннийНомерВАТС
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка <> &ТекущийПользовательСсылка
		|	И НЕ Пользователи.Недействителен
		|	И ((Пользователи.смартРабочийТелефон <> """" И Пользователи.смартРабочийТелефон = &смартРабочийТелефон)
		//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
		//|	   ИЛИ (Пользователи.смартВнутреннийНомерВАТС <> """" И Пользователи.смартВнутреннийНомерВАТС = &смартВнутреннийНомерВАТС))";
		|	   ИЛИ (Пользователи.смартВнутреннийНомерВАТС <> """" И Пользователи.смартВнутреннийНомерВАТС = &смартВнутреннийНомерВАТС)
		|	   ИЛИ (Пользователи.смартВнутреннийНомерВАТСДополнительный <> """" И Пользователи.смартВнутреннийНомерВАТСДополнительный = &смартВнутреннийНомерВАТСДополнительный))";
		
	Запрос.УстановитьПараметр("смартВнутреннийНомерВАТСДополнительный", Объект.смартВнутреннийНомерВАТСДополнительный);
	//-- #Б-6744 смарт: Фролов 28.05.2026
	Запрос.УстановитьПараметр("смартРабочийТелефон", Объект.смартРабочийТелефон);
	Запрос.УстановитьПараметр("смартВнутреннийНомерВАТС", Объект.смартВнутреннийНомерВАТС);
	Запрос.УстановитьПараметр("ТекущийПользовательСсылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Объект.смартРабочийТелефон) И Объект.смартРабочийТелефон = РезультатЗапроса.смартРабочийТелефон Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Пользователю """ + СокрЛП(РезультатЗапроса.Ссылка) + """ уже назначен номер телефона: внутр.: " + СокрЛП(Объект.смартРабочийТелефон),
				Объект.Ссылка,
				"Объект.смартРабочийТелефон",
				,
				Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.смартВнутреннийНомерВАТС) И Объект.смартВнутреннийНомерВАТС = РезультатЗапроса.смартВнутреннийНомерВАТС Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Пользователю """ + СокрЛП(РезультатЗапроса.Ссылка) + """ уже назначен номер телефона: ВАТС: " + СокрЛП(Объект.смартВнутреннийНомерВАТС),
				Объект.Ссылка,
				"Объект.смартВнутреннийНомерВАТС",
				,
				Отказ);
		КонецЕсли;
		
		//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
		Если ЗначениеЗаполнено(Объект.смартВнутреннийНомерВАТСДополнительный) И Объект.смартВнутреннийНомерВАТСДополнительный = РезультатЗапроса.смартВнутреннийНомерВАТСДополнительный Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Пользователю """ + СокрЛП(РезультатЗапроса.Ссылка) + """ уже назначен номер телефона: ВАТС дополнительный: " + СокрЛП(Объект.смартВнутреннийНомерВАТСДополнительный),
				Объект.Ссылка,
				"Объект.смартВнутреннийНомерВАТСДополнительный",
				,
				Отказ);
		КонецЕсли;
		//-- #Б-6744 смарт: Фролов 28.05.2026	
			
	КонецЦикла;	
	
КонецПроцедуры //--#1352 смарт: Лопато 10.05.2023

//++#1352 смарт: Лопато 10.05.2023 //Звонки из 1С (через городской стационарный телефон)  
&НаКлиенте
Процедура смартНомерТелефонаПриИзменении(Элемент)
	
	//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров
	//Если ЗначениеЗаполнено(Объект.смартРабочийТелефон) ИЛИ ЗначениеЗаполнено(Объект.смартВнутреннийНомерВАТС) Тогда
	Если ЗначениеЗаполнено(Объект.смартРабочийТелефон) ИЛИ ЗначениеЗаполнено(Объект.смартВнутреннийНомерВАТС) ИЛИ ЗначениеЗаполнено(Объект.смартВнутреннийНомерВАТСДополнительный) Тогда
	//-- #Б-6744 смарт: Фролов 28.05.2026	
		смартПроверитьДублиНомеров(Ложь);
	КонецЕсли;	
	
КонецПроцедуры //--#1352 смарт: Лопато 10.05.2023

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
//++ #Б-6630 смарт: Фролов 30.04.2026 //Сделать механизм оповещений о новых Инцидентах.
Процедура смарт_ПередЗаписью(Отказ, ПараметрыЗаписи)

	ОчиститьСообщения();

	ЗаголовокВопросов = НСтр("ru='Запись пользователя информационной базы'");

	// Копирование прав пользователя.
	Если ЗначениеЗаполнено(ЗначениеКопирования)
		И Не ЗначениеЗаполнено(Объект.Ссылка)
		И ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом")
		И (Не ПараметрыЗаписи.Свойство("НеКопироватьПраваПользователя")
		И Не ПараметрыЗаписи.Свойство("КопироватьПраваПользователя")) Тогда

		Отказ = Истина;
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ПослеОтветаНаВопросОКопированииПрав", ЭтотОбъект, ПараметрыЗаписи),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Скопировать также права пользователя ""%1""?'"), Строка(ЗначениеКопирования)),
		РежимДиалогаВопрос.ДаНет,
		,
		,
		ЗаголовокВопросов);
		Возврат;
	КонецЕсли;

	Если ВходВПрограммуРазрешен Тогда

		Если ДействияВФорме.Роли = "Редактирование"
			И ПользовательИБРоли.Количество() = 0 Тогда

			Если НЕ ПараметрыЗаписи.Свойство("СПустымСпискомРолей") Тогда
				Отказ = Истина;
				ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаписиСПустымСпискомРолей", ЭтотОбъект, ПараметрыЗаписи),
				НСтр("ru='Пользователю информационной базы не установлено ни одной роли. Продолжить?'"),
				РежимДиалогаВопрос.ДаНет,
				,
				,
				ЗаголовокВопросов);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Обработка записи первого администратора.
		Если НЕ ПараметрыЗаписи.Свойство("ССозданиемПервогоАдминистратора") Тогда
			Отказ = Истина;
			ПараметрыЗаписиПриПроверкеПервогоАдминистратора = ПараметрыЗаписи;
			ПодключитьОбработчикОжидания("ПроверитьПервогоАдминистратора", 0.1, Истина);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().РазделениеВключено
		И ТребуетсяСинхронизацияССервисом
		И ПарольПользователяСервиса = Неопределено Тогда

		Отказ = Истина;
		ПользователиСлужебныйКлиент.ЗапроситьПарольДляАутентификацииВСервисе(
		Новый ОписаниеОповещения("ПослеЗапросаПароляДляАутентификацииВСервисеПередЗаписью", ЭтотОбъект, ПараметрыЗаписи),
		ЭтотОбъект,
		ПарольПользователяСервиса);
		Возврат;
	КонецЕсли;
	
	#Вставка
	//++ #Б-6630 смарт: Фролов 30.04.2026 //Сделать механизм оповещений о новых Инцидентах.
	НомСтрОповещения = 1;
	
	Для Каждого Стр Из Объект.смартОповещениеОбИнтересах Цикл
		
		Если НЕ (Стр.Оборудование ИЛИ Стр.Запчасти ИЛИ Стр.РасходныеМатериалы ИЛИ Стр.Прочее) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("В строке " + НомСтрОповещения + 
				" табличной части на закладке ""Оповещение об интересах и инцидентах (Смарт)"" не заполнен Тип продукта" ,,,, Отказ);	
			
		КонецЕсли;
		
		НомСтрОповещения = НомСтрОповещения + 1;
		
	КонецЦикла;
	//-- #Б-6630 смарт: Фролов 30.04.2026
	#КонецВставки

КонецПроцедуры //-- #Б-6630 смарт: Фролов 30.04.2026

#КонецОбласти
